import { GoldPricePeriodSummaryInfo } from "../../src/models/gold-price-period-summary";

export const goldPricePeriodSummary: GoldPricePeriodSummaryInfo = {
  startDate: new Date("2024-01-01"),
  endDate: new Date("2024-01-05"),
  currentPrice: { Buy: 100, Sell: 100 },
  summary: {
    summaries: [
      "เช้าวันที่ 10 พฤษภาคม 2568 ราคาทองคำแท่ง 96.5% มีการปรับตัวลดลง โดยราคารับซื้ออยู่ที่ 51,850 บาท และราคาขายออกอยู่ที่ 51,950 บาท ซึ่งลดลง 50 บาทจากเมื่อวาน 📉",
      "บริษัท InterGOLD Gold Trade Co.,Ltd. ได้เผยแพร่บทวิเคราะห์ราคาทองคำและข่าวสารที่เกี่ยวข้อง",
      "ฮั่วเซ่งเฮงยังคงให้บริการซื้อขายทองคำ 96.5% และ 99.99% รวมถึง USD GOLD TRADE และตราสารอนุพันธ์ต่างๆ 💰",
    ],
    predictions: [
      "จากข้อมูลราคาทองคำที่ปรับตัวลดลงเล็กน้อย อาจเป็นสัญญาณบ่งบอกถึงการชะลอตัวของตลาดทองคำในระยะสั้น 🤔",
      "อย่างไรก็ตาม, เนื่องจากมีหลายปัจจัยที่ส่งผลต่อราคาทองคำ การวิเคราะห์ปัจจัยพื้นฐานและข่าวสารที่เกี่ยวข้องอย่างรอบคอบจึงเป็นสิ่งสำคัญในการตัดสินใจลงทุน 🧐",
      "การเปลี่ยนแปลงราคา -50 บาท อาจบ่งชี้ถึงแรงกดดันในการขาย หรือการทำกำไรของนักลงทุนบางส่วน, จับตาดูแนวโน้มราคาทองคำอย่างใกล้ชิด 🔭",
    ],
  },
};
